
#### Terraform Plan
<details>
<summary>Expand</summary>

```
Running plan in Terraform Cloud. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/timovink/infra-shared/runs/run-82AHsKDdoYcNuCBC

Waiting for the plan to start...

Terraform v1.2.2
on linux_amd64
Initializing plugins and modules...
module.global_certificate["timovink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/c14c4e0f-400b-415b-bdf9-f5b38995b474]
module.global_certificate["timovink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/b5424589-49e4-41be-aed5-4e0387f5e995]
module.global_certificate["timovink.app"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/ed6e0edc-3d1a-41fd-900a-9342fcb09642]
module.global_certificate["timovink.dev"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-east-1:920122847127:certificate/c37f96fe-c8d6-4cfa-a752-9b95610577d1]
module.local_certificate["timovink.ca"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/1d5e180f-aceb-44e7-93ff-d116ec4132dc]
module.local_certificate["timovink.dev"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/bf00816d-2214-47e9-9533-e82bf38b838e]
module.budget.aws_budgets_budget.monthly: Refreshing state... [id=920122847127:terraform-20220612005833117900000001]
module.domain_redirects.aws_cloudfront_function.redirect: Refreshing state... [id=tv-sharedinfra-redirecttoprimary]
module.iam.aws_iam_user.admin["tvink"]: Refreshing state... [id=tvink]
module.local_certificate["timovink.com"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/9cf0da07-dfd0-4ffd-bc97-1d53a1c498cb]
module.iam.aws_iam_group.administrators: Refreshing state... [id=administrators]
module.iam.aws_iam_user.admin["deployer"]: Refreshing state... [id=deployer]
module.dns["timovink.app"].aws_route53_zone.this: Refreshing state... [id=Z090672659X2JIXVUFX0]
module.local_certificate["timovink.app"].aws_acm_certificate.this: Refreshing state... [id=arn:aws:acm:us-west-2:920122847127:certificate/a5f9fd0b-1fac-49d1-beba-b87ce4550483]
module.dns["timovink.ca"].aws_route53_zone.this: Refreshing state... [id=Z08658091IB2VPYFZRTIS]
module.dns["timovink.dev"].aws_route53_zone.this: Refreshing state... [id=Z09071302Y5GD83DY6NXW]
module.dns["timovink.com"].aws_route53_zone.this: Refreshing state... [id=ZFMCDCUJ8UCFO]
module.iam.aws_iam_user_group_membership.admin["deployer"]: Refreshing state... [id=terraform-20220604232226591200000002]
module.iam.aws_iam_user_group_membership.admin["tvink"]: Refreshing state... [id=terraform-20220605021751235700000002]
module.iam.aws_iam_group_policy_attachment.administrators: Refreshing state... [id=administrators-20220605021751233100000001]
module.local_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.local_certificate["timovink.app"].aws_route53_record.validation["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["timovink.com"].aws_route53_record.validation["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.global_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.global_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.global_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["timovink.ca"].aws_route53_record.validation["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.local_certificate["timovink.ca"].aws_route53_record.validation["*.timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS__78aa3e24a54e517847b5c3573be744e9.timovink.ca._CNAME]
module.global_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.global_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.local_certificate["timovink.com"].aws_route53_record.validation["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.local_certificate["timovink.com"].aws_route53_record.validation["*.timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO__d792b113bb70820125d76b1d48a01fcb.timovink.com._CNAME]
module.local_certificate["timovink.dev"].aws_route53_record.validation["*.timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.local_certificate["timovink.dev"].aws_route53_record.validation["timovink.dev"]: Refreshing state... [id=Z09071302Y5GD83DY6NXW__aec79ae1e60595e5c546c99005405cb2.timovink.dev._CNAME]
module.global_certificate["timovink.app"].aws_route53_record.validation["*.timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["timovink.app"].aws_route53_record.validation["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0__898a605fd844d2311876cf17ced2654a.timovink.app._CNAME]
module.global_certificate["timovink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.app"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.global_certificate["timovink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2022-06-05 03:29:25.278 +0000 UTC]
module.global_certificate["timovink.dev"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.com"].aws_acm_certificate_validation.this: Refreshing state... [id=2022-06-05 03:29:26.207 +0000 UTC]
module.local_certificate["timovink.app"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.ca"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.local_certificate["timovink.dev"].aws_acm_certificate_validation.this: Refreshing state... [id=0001-01-01 00:00:00 +0000 UTC]
module.domain_redirects.aws_cloudfront_distribution.this["timovink.com"]: Refreshing state... [id=E200E95Q71F1CC]
module.domain_redirects.aws_cloudfront_distribution.this["timovink.ca"]: Refreshing state... [id=E13S2CRFR1K2EJ]
module.domain_redirects.aws_cloudfront_distribution.this["timovink.app"]: Refreshing state... [id=EA449TJZFYK4B]
module.domain_redirects.aws_route53_record.this["timovink.ca"]: Refreshing state... [id=Z08658091IB2VPYFZRTIS_timovink.ca_A]
module.domain_redirects.aws_route53_record.this["timovink.app"]: Refreshing state... [id=Z090672659X2JIXVUFX0_timovink.app_A]
module.domain_redirects.aws_route53_record.this["timovink.com"]: Refreshing state... [id=ZFMCDCUJ8UCFO_timovink.com_A]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # module.dns["jackievink.ca"].aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "jackievink.ca"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Project" = "tv-sharedinfra"
        }
      + zone_id       = (known after apply)
    }

  # module.dns["jackievink.com"].aws_route53_zone.this will be created
  + resource "aws_route53_zone" "this" {
      + arn           = (known after apply)
      + comment       = "Managed by Terraform"
      + force_destroy = false
      + id            = (known after apply)
      + name          = "jackievink.com"
      + name_servers  = (known after apply)
      + tags_all      = {
          + "Project" = "tv-sharedinfra"
        }
      + zone_id       = (known after apply)
    }

  # module.domain_redirects.aws_cloudfront_distribution.this["timovink.app"] will be destroyed
  # (because module.domain_redirects is not in configuration)
  - resource "aws_cloudfront_distribution" "this" {
      - aliases                        = [
          - "timovink.app",
        ] -> null
      - arn                            = "arn:aws:cloudfront::920122847127:distribution/EA449TJZFYK4B" -> null
      - caller_reference               = "terraform-20220605083707388000000002" -> null
      - domain_name                    = "d1l21qbstozdu6.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E1SVR5FP7OHFA4" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "EA449TJZFYK4B" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2022-06-05 08:37:07.546 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Project" = "tv-sharedinfra"
        } -> null
      - trusted_key_groups             = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 0 -> null
          - max_ttl                = 0 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "default" -> null
          - trusted_key_groups     = [] -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "allow-all" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttoprimary" -> null
            }
        }

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "timovink.dev" -> null
          - origin_id           = "default" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:920122847127:certificate/ed6e0edc-3d1a-41fd-900a-9342fcb09642" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # module.domain_redirects.aws_cloudfront_distribution.this["timovink.ca"] will be destroyed
  # (because module.domain_redirects is not in configuration)
  - resource "aws_cloudfront_distribution" "this" {
      - aliases                        = [
          - "timovink.ca",
        ] -> null
      - arn                            = "arn:aws:cloudfront::920122847127:distribution/E13S2CRFR1K2EJ" -> null
      - caller_reference               = "terraform-20220605083707386000000001" -> null
      - domain_name                    = "d2bfxhe1sagpyh.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E1PQMO48U2EXUT" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E13S2CRFR1K2EJ" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2022-06-05 08:37:07.541 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Project" = "tv-sharedinfra"
        } -> null
      - trusted_key_groups             = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 0 -> null
          - max_ttl                = 0 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "default" -> null
          - trusted_key_groups     = [] -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "allow-all" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttoprimary" -> null
            }
        }

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "timovink.dev" -> null
          - origin_id           = "default" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:920122847127:certificate/c14c4e0f-400b-415b-bdf9-f5b38995b474" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # module.domain_redirects.aws_cloudfront_distribution.this["timovink.com"] will be destroyed
  # (because module.domain_redirects is not in configuration)
  - resource "aws_cloudfront_distribution" "this" {
      - aliases                        = [
          - "timovink.com",
        ] -> null
      - arn                            = "arn:aws:cloudfront::920122847127:distribution/E200E95Q71F1CC" -> null
      - caller_reference               = "terraform-20220605083707388600000003" -> null
      - domain_name                    = "d9mlkg81u40c3.cloudfront.net" -> null
      - enabled                        = true -> null
      - etag                           = "E2TLAM8D62Z100" -> null
      - hosted_zone_id                 = "Z2FDTNDATAQYW2" -> null
      - http_version                   = "http2" -> null
      - id                             = "E200E95Q71F1CC" -> null
      - in_progress_validation_batches = 0 -> null
      - is_ipv6_enabled                = false -> null
      - last_modified_time             = "2022-06-05 08:37:07.54 +0000 UTC" -> null
      - price_class                    = "PriceClass_All" -> null
      - retain_on_delete               = false -> null
      - status                         = "Deployed" -> null
      - tags                           = {} -> null
      - tags_all                       = {
          - "Project" = "tv-sharedinfra"
        } -> null
      - trusted_key_groups             = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - trusted_signers                = [
          - {
              - enabled = false
              - items   = []
            },
        ] -> null
      - wait_for_deployment            = true -> null

      - default_cache_behavior {
          - allowed_methods        = [
              - "DELETE",
              - "GET",
              - "HEAD",
              - "OPTIONS",
              - "PATCH",
              - "POST",
              - "PUT",
            ] -> null
          - cached_methods         = [
              - "GET",
              - "HEAD",
              - "OPTIONS",
            ] -> null
          - compress               = false -> null
          - default_ttl            = 0 -> null
          - max_ttl                = 0 -> null
          - min_ttl                = 0 -> null
          - smooth_streaming       = false -> null
          - target_origin_id       = "default" -> null
          - trusted_key_groups     = [] -> null
          - trusted_signers        = [] -> null
          - viewer_protocol_policy = "allow-all" -> null

          - forwarded_values {
              - headers                 = [] -> null
              - query_string            = true -> null
              - query_string_cache_keys = [] -> null

              - cookies {
                  - forward           = "all" -> null
                  - whitelisted_names = [] -> null
                }
            }

          - function_association {
              - event_type   = "viewer-request" -> null
              - function_arn = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttoprimary" -> null
            }
        }

      - origin {
          - connection_attempts = 3 -> null
          - connection_timeout  = 10 -> null
          - domain_name         = "timovink.dev" -> null
          - origin_id           = "default" -> null

          - custom_origin_config {
              - http_port                = 80 -> null
              - https_port               = 443 -> null
              - origin_keepalive_timeout = 5 -> null
              - origin_protocol_policy   = "match-viewer" -> null
              - origin_read_timeout      = 30 -> null
              - origin_ssl_protocols     = [
                  - "TLSv1.2",
                ] -> null
            }
        }

      - restrictions {
          - geo_restriction {
              - locations        = [] -> null
              - restriction_type = "none" -> null
            }
        }

      - viewer_certificate {
          - acm_certificate_arn            = "arn:aws:acm:us-east-1:920122847127:certificate/b5424589-49e4-41be-aed5-4e0387f5e995" -> null
          - cloudfront_default_certificate = false -> null
          - minimum_protocol_version       = "TLSv1" -> null
          - ssl_support_method             = "sni-only" -> null
        }
    }

  # module.domain_redirects.aws_cloudfront_function.redirect will be destroyed
  # (because module.domain_redirects is not in configuration)
  - resource "aws_cloudfront_function" "redirect" {
      - arn             = "arn:aws:cloudfront::920122847127:function/tv-sharedinfra-redirecttoprimary" -> null
      - code            = <<-EOT
            function handler(event) {
                return {
                    statusCode: 301,
                    statusDescription: 'Moved Permanently',
                    headers: {
                        'location': { value: `https://timovink.dev${event.request.uri}` }
                    }
                };
            }
        EOT -> null
      - etag            = "E1F83G8C2ARO7P" -> null
      - id              = "tv-sharedinfra-redirecttoprimary" -> null
      - live_stage_etag = "E1F83G8C2ARO7P" -> null
      - name            = "tv-sharedinfra-redirecttoprimary" -> null
      - publish         = true -> null
      - runtime         = "cloudfront-js-1.0" -> null
      - status          = "DEPLOYED" -> null
    }

  # module.domain_redirects.aws_route53_record.this["timovink.app"] will be destroyed
  # (because module.domain_redirects is not in configuration)
  - resource "aws_route53_record" "this" {
      - fqdn    = "timovink.app" -> null
      - id      = "Z090672659X2JIXVUFX0_timovink.app_A" -> null
      - name    = "timovink.app" -> null
      - records = [] -> null
      - ttl     = 0 -> null
      - type    = "A" -> null
      - zone_id = "Z090672659X2JIXVUFX0" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d1l21qbstozdu6.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.domain_redirects.aws_route53_record.this["timovink.ca"] will be destroyed
  # (because module.domain_redirects is not in configuration)
  - resource "aws_route53_record" "this" {
      - fqdn    = "timovink.ca" -> null
      - id      = "Z08658091IB2VPYFZRTIS_timovink.ca_A" -> null
      - name    = "timovink.ca" -> null
      - records = [] -> null
      - ttl     = 0 -> null
      - type    = "A" -> null
      - zone_id = "Z08658091IB2VPYFZRTIS" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d2bfxhe1sagpyh.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.domain_redirects.aws_route53_record.this["timovink.com"] will be destroyed
  # (because module.domain_redirects is not in configuration)
  - resource "aws_route53_record" "this" {
      - fqdn    = "timovink.com" -> null
      - id      = "ZFMCDCUJ8UCFO_timovink.com_A" -> null
      - name    = "timovink.com" -> null
      - records = [] -> null
      - ttl     = 0 -> null
      - type    = "A" -> null
      - zone_id = "ZFMCDCUJ8UCFO" -> null

      - alias {
          - evaluate_target_health = false -> null
          - name                   = "d9mlkg81u40c3.cloudfront.net" -> null
          - zone_id                = "Z2FDTNDATAQYW2" -> null
        }
    }

  # module.domain_redirects["jackievink.com"].aws_cloudfront_distribution.this["jackievink.ca"] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                        = [
          + "jackievink.ca",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "Project" = "tv-sharedinfra"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "default"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "jackievink.com"
          + origin_id           = "default"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = (known after apply)
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.domain_redirects["jackievink.com"].aws_cloudfront_function.redirect will be created
  + resource "aws_cloudfront_function" "redirect" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
                return {
                    statusCode: 301,
                    statusDescription: 'Moved Permanently',
                    headers: {
                        'location': { value: `https://jackievink.com${event.request.uri}` }
                    }
                };
            }
        EOT
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "tv-sharedinfra-redirecttoprimary"
      + publish         = true
      + runtime         = "cloudfront-js-1.0"
      + status          = (known after apply)
    }

  # module.domain_redirects["jackievink.com"].aws_route53_record.this["jackievink.ca"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "jackievink.ca"
      + type            = "A"
      + zone_id         = (known after apply)

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.app"] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                        = [
          + "timovink.app",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "Project" = "tv-sharedinfra"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "default"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "timovink.dev"
          + origin_id           = "default"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:920122847127:certificate/ed6e0edc-3d1a-41fd-900a-9342fcb09642"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.ca"] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                        = [
          + "timovink.ca",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "Project" = "tv-sharedinfra"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "default"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "timovink.dev"
          + origin_id           = "default"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:920122847127:certificate/c14c4e0f-400b-415b-bdf9-f5b38995b474"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.domain_redirects["timovink.dev"].aws_cloudfront_distribution.this["timovink.com"] will be created
  + resource "aws_cloudfront_distribution" "this" {
      + aliases                        = [
          + "timovink.com",
        ]
      + arn                            = (known after apply)
      + caller_reference               = (known after apply)
      + domain_name                    = (known after apply)
      + enabled                        = true
      + etag                           = (known after apply)
      + hosted_zone_id                 = (known after apply)
      + http_version                   = "http2"
      + id                             = (known after apply)
      + in_progress_validation_batches = (known after apply)
      + is_ipv6_enabled                = false
      + last_modified_time             = (known after apply)
      + price_class                    = "PriceClass_All"
      + retain_on_delete               = false
      + status                         = (known after apply)
      + tags_all                       = {
          + "Project" = "tv-sharedinfra"
        }
      + trusted_key_groups             = (known after apply)
      + trusted_signers                = (known after apply)
      + wait_for_deployment            = true

      + default_cache_behavior {
          + allowed_methods        = [
              + "DELETE",
              + "GET",
              + "HEAD",
              + "OPTIONS",
              + "PATCH",
              + "POST",
              + "PUT",
            ]
          + cached_methods         = [
              + "GET",
              + "HEAD",
              + "OPTIONS",
            ]
          + compress               = false
          + default_ttl            = (known after apply)
          + max_ttl                = (known after apply)
          + min_ttl                = 0
          + target_origin_id       = "default"
          + trusted_key_groups     = (known after apply)
          + trusted_signers        = (known after apply)
          + viewer_protocol_policy = "allow-all"

          + forwarded_values {
              + headers                 = (known after apply)
              + query_string            = true
              + query_string_cache_keys = (known after apply)

              + cookies {
                  + forward           = "all"
                  + whitelisted_names = (known after apply)
                }
            }

          + function_association {
              + event_type   = "viewer-request"
              + function_arn = (known after apply)
            }
        }

      + origin {
          + connection_attempts = 3
          + connection_timeout  = 10
          + domain_name         = "timovink.dev"
          + origin_id           = "default"

          + custom_origin_config {
              + http_port                = 80
              + https_port               = 443
              + origin_keepalive_timeout = 5
              + origin_protocol_policy   = "match-viewer"
              + origin_read_timeout      = 30
              + origin_ssl_protocols     = [
                  + "TLSv1.2",
                ]
            }
        }

      + restrictions {
          + geo_restriction {
              + locations        = (known after apply)
              + restriction_type = "none"
            }
        }

      + viewer_certificate {
          + acm_certificate_arn      = "arn:aws:acm:us-east-1:920122847127:certificate/b5424589-49e4-41be-aed5-4e0387f5e995"
          + minimum_protocol_version = "TLSv1"
          + ssl_support_method       = "sni-only"
        }
    }

  # module.domain_redirects["timovink.dev"].aws_cloudfront_function.redirect will be created
  + resource "aws_cloudfront_function" "redirect" {
      + arn             = (known after apply)
      + code            = <<-EOT
            function handler(event) {
                return {
                    statusCode: 301,
                    statusDescription: 'Moved Permanently',
                    headers: {
                        'location': { value: `https://timovink.dev${event.request.uri}` }
                    }
                };
            }
        EOT
      + etag            = (known after apply)
      + id              = (known after apply)
      + live_stage_etag = (known after apply)
      + name            = "tv-sharedinfra-redirecttoprimary"
      + publish         = true
      + runtime         = "cloudfront-js-1.0"
      + status          = (known after apply)
    }

  # module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.app"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "timovink.app"
      + type            = "A"
      + zone_id         = "Z090672659X2JIXVUFX0"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.ca"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "timovink.ca"
      + type            = "A"
      + zone_id         = "Z08658091IB2VPYFZRTIS"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.domain_redirects["timovink.dev"].aws_route53_record.this["timovink.com"] will be created
  + resource "aws_route53_record" "this" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "timovink.com"
      + type            = "A"
      + zone_id         = "ZFMCDCUJ8UCFO"

      + alias {
          + evaluate_target_health = false
          + name                   = (known after apply)
          + zone_id                = (known after apply)
        }
    }

  # module.global_certificate["jackievink.ca"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "jackievink.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.jackievink.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "jackievink.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.jackievink.ca",
          + "jackievink.ca",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.global_certificate["jackievink.ca"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.global_certificate["jackievink.ca"].aws_route53_record.validation["*.jackievink.ca"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.global_certificate["jackievink.ca"].aws_route53_record.validation["jackievink.ca"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.global_certificate["jackievink.com"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "jackievink.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.jackievink.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "jackievink.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.jackievink.com",
          + "jackievink.com",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.global_certificate["jackievink.com"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.global_certificate["jackievink.com"].aws_route53_record.validation["*.jackievink.com"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.global_certificate["jackievink.com"].aws_route53_record.validation["jackievink.com"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.local_certificate["jackievink.ca"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "jackievink.ca"
      + domain_validation_options = [
          + {
              + domain_name           = "*.jackievink.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "jackievink.ca"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.jackievink.ca",
          + "jackievink.ca",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.local_certificate["jackievink.ca"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.local_certificate["jackievink.ca"].aws_route53_record.validation["*.jackievink.ca"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.local_certificate["jackievink.ca"].aws_route53_record.validation["jackievink.ca"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.local_certificate["jackievink.com"].aws_acm_certificate.this will be created
  + resource "aws_acm_certificate" "this" {
      + arn                       = (known after apply)
      + domain_name               = "jackievink.com"
      + domain_validation_options = [
          + {
              + domain_name           = "*.jackievink.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
          + {
              + domain_name           = "jackievink.com"
              + resource_record_name  = (known after apply)
              + resource_record_type  = (known after apply)
              + resource_record_value = (known after apply)
            },
        ]
      + id                        = (known after apply)
      + status                    = (known after apply)
      + subject_alternative_names = [
          + "*.jackievink.com",
          + "jackievink.com",
        ]
      + tags_all                  = {
          + "Project" = "tv-sharedinfra"
        }
      + validation_emails         = (known after apply)
      + validation_method         = "DNS"
    }

  # module.local_certificate["jackievink.com"].aws_acm_certificate_validation.this will be created
  + resource "aws_acm_certificate_validation" "this" {
      + certificate_arn         = (known after apply)
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # module.local_certificate["jackievink.com"].aws_route53_record.validation["*.jackievink.com"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

  # module.local_certificate["jackievink.com"].aws_route53_record.validation["jackievink.com"] will be created
  + resource "aws_route53_record" "validation" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = (known after apply)
      + records         = (known after apply)
      + ttl             = 60
      + type            = (known after apply)
      + zone_id         = (known after apply)
    }

Plan: 28 to add, 0 to change, 7 to destroy.
```

</details>